{
  "architectures": [
    "XLMRobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "ab",
    "1": "ab_ce_mix",
    "2": "ab_kbd_mix",
    "3": "ba",
    "4": "be",
    "5": "be_rue_mix",
    "6": "bg",
    "7": "bg_mk_mix",
    "8": "bxr",
    "9": "ce",
    "10": "cv",
    "11": "kbd",
    "12": "kbd_ce_mix",
    "13": "kk",
    "14": "kk_ky_mix",
    "15": "koi",
    "16": "koi_kv_mix",
    "17": "kv",
    "18": "ky",
    "19": "mhr",
    "20": "mk",
    "21": "mk_sr_mix",
    "22": "mn",
    "23": "myv",
    "24": "myv_mhr_mix",
    "25": "os",
    "26": "ru",
    "27": "ru_be_mix",
    "28": "ru_uk_mix",
    "29": "rue",
    "30": "sah",
    "31": "sr",
    "32": "sr_bg_mix",
    "33": "tg",
    "34": "tt",
    "35": "tt_ba_mix",
    "36": "tyv",
    "37": "udm",
    "38": "udm_koi_mix",
    "39": "udm_kv_mix",
    "40": "uk",
    "41": "uk_be_mix",
    "42": "uk_rue_mix"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "ab": 0,
    "ab_ce_mix": 1,
    "ab_kbd_mix": 2,
    "ba": 3,
    "be": 4,
    "be_rue_mix": 5,
    "bg": 6,
    "bg_mk_mix": 7,
    "bxr": 8,
    "ce": 9,
    "cv": 10,
    "kbd": 11,
    "kbd_ce_mix": 12,
    "kk": 13,
    "kk_ky_mix": 14,
    "koi": 15,
    "koi_kv_mix": 16,
    "kv": 17,
    "ky": 18,
    "mhr": 19,
    "mk": 20,
    "mk_sr_mix": 21,
    "mn": 22,
    "myv": 23,
    "myv_mhr_mix": 24,
    "os": 25,
    "ru": 26,
    "ru_be_mix": 27,
    "ru_uk_mix": 28,
    "rue": 29,
    "sah": 30,
    "sr": 31,
    "sr_bg_mix": 32,
    "tg": 33,
    "tt": 34,
    "tt_ba_mix": 35,
    "tyv": 36,
    "udm": 37,
    "udm_koi_mix": 38,
    "udm_kv_mix": 39,
    "uk": 40,
    "uk_be_mix": 41,
    "uk_rue_mix": 42
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250002
}
